test/performance/results/2025-04-22-calpe/localhost-autonomi-http.txt
$ cat src/localhost-autonomi-http.js; k6 run -u 10 -i 1000 src/localhost-autonomi-http.js 
import http from 'k6/http';

export default function () {
  http.get('http://localhost:8080/cec7a9eb2c644b9a5de58bbcdf2e893db9f0b2acd7fc563fc849e19d1f6bd872/1_QdxdljdwBwR2QbAVr8scuw.png', { timeout: '600s' });
  http.get('http://localhost:8080/cec7a9eb2c644b9a5de58bbcdf2e893db9f0b2acd7fc563fc849e19d1f6bd872/1_dH5Ce6neTHIfEkAbmsr1BQ.jpeg', { timeout: '600s' });
  http.get('http://localhost:8080/cec7a9eb2c644b9a5de58bbcdf2e893db9f0b2acd7fc563fc849e19d1f6bd872/1_pt48p45dQmR5PBW8np1l8Q.png', { timeout: '600s' });
  http.get('http://localhost:8080/cec7a9eb2c644b9a5de58bbcdf2e893db9f0b2acd7fc563fc849e19d1f6bd872/1_sWZ4OWGeQjWs6urcPwR6Yw.png', { timeout: '600s' });
  http.get('http://localhost:8080/cec7a9eb2c644b9a5de58bbcdf2e893db9f0b2acd7fc563fc849e19d1f6bd872/1_ZT6qplX5Yt8PMCUqxq1lFQ.png', { timeout: '600s' });
  http.get('http://localhost:8080/cec7a9eb2c644b9a5de58bbcdf2e893db9f0b2acd7fc563fc849e19d1f6bd872/1_SxkGLnSNsMtu0SDrsWW8Wg.jpeg', { timeout: '600s' });
  http.get('http://localhost:8080/cec7a9eb2c644b9a5de58bbcdf2e893db9f0b2acd7fc563fc849e19d1f6bd872/1_bogEVpJvgx_gMHQoHMoSLg.jpeg', { timeout: '600s' });
  http.get('http://localhost:8080/cec7a9eb2c644b9a5de58bbcdf2e893db9f0b2acd7fc563fc849e19d1f6bd872/1_LFEyRQMHmxRnZtJwMozW5w.jpeg', { timeout: '600s' });
}

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: src/localhost-autonomi-http.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 1000 iterations shared among 10 VUs (maxDuration: 10m0s, gracefulStop: 30s)


     data_received..................: 1.0 GB 1.7 MB/s
     data_sent......................: 403 kB 663 B/s
     dropped_iterations.............: 710    1.170219/s
     http_req_blocked...............: avg=9.24µs   min=2.33µs   med=5.15µs   max=776.46µs p(90)=9.62µs  p(95)=13.23µs
     http_req_connecting............: avg=1.08µs   min=0s       med=0s       max=437.41µs p(90)=0s      p(95)=0s     
     http_req_duration..............: avg=2.61s    min=1.05s    med=1.74s    max=16.76s   p(90)=5.94s   p(95)=6.51s  
       { expected_response:true }...: avg=2.61s    min=1.05s    med=1.74s    max=16.76s   p(90)=5.94s   p(95)=6.51s  
     http_req_failed................: 0.00%  0 out of 2320
     http_req_receiving.............: avg=1.76s    min=496.21ms med=1.1s     max=16.43s   p(90)=3.53s   p(95)=5.63s  
     http_req_sending...............: avg=31.7µs   min=7.51µs   med=16.86µs  max=1.93ms   p(90)=39.12µs p(95)=53.88µs
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(90)=0s      p(95)=0s     
     http_req_waiting...............: avg=847.41ms min=318.7ms  med=571.16ms max=5.78s    p(90)=1.12s   p(95)=2.97s  
     http_reqs......................: 2320   3.823813/s
     iteration_duration.............: avg=20.92s   min=14.27s   med=19.84s   max=34.8s    p(90)=30.38s  p(95)=33.01s 
     iterations.....................: 290    0.477977/s
     vus............................: 10     min=10        max=10
     vus_max........................: 10     min=10        max=10


running (10m06.7s), 00/10 VUs, 290 complete and 0 interrupted iterations